In [1]:
#Import the titanic dataset.

import pandas as pd
df = pd.read_csv("E:/datafiles/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
#Now from the titanic dataset consider only required columns and drop the remaining columns.
#Required columns are 'Pclass','Sex','Age','Fare','Survived'.

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
#Now choose our independent variables(inputs), dependent variables(target).

inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [4]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
#We know that sex column is in text format and machine learning model doesnot handle text format
#So by using dummies or OneHotEncoding technique we will convert sex column from text to numbers(integers)
#Below we are using dummies technique this can be done by using pandas concat function

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
#Now append these dummies [female,male] into inputs dataframe by using pd.concat function.

inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
#Dropping Sex,male column as well because of dummy variable trap theory.One column is enough to repressent male vs female

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
#We need to check and fill whether N/A values are present in the above dataset in order to get good accuracy

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [12]:
#We have different approaches to fill N/A values but the popular approach is taking the mean of entire column
#and fill those N/A values with the mean value

In [13]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [14]:
#Now we are using sklearn train_test_split method in order to split,train and test our dataset.

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [15]:
#To see the length of X_train.

len(X_train)

623

In [16]:
#To see the length of X_test.

len(X_test)

268

In [17]:
#To see the length of inputs.

len(inputs)

891

In [18]:
#Now create a Naive_Bayes model there are couple of Naive_Bayes classes but we are using GaussianNB
#We use GaussianNB when your data distribution is normal or it is like a Gaussian distribution
 
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [19]:
#We have to call the fit method when we want to train the model

model.fit(X_train,y_train)

GaussianNB()

In [20]:
#Now to see your model score.

model.score(X_test,y_test)

0.7350746268656716

In [21]:
#Checking x_test and y_test samples.

X_test[0:10]

     Pclass        Age     Fare  female
251       3  29.000000  10.4625       1
400       3  39.000000   7.9250       0
868       3  29.699118   9.5000       0
699       3  42.000000   7.6500       0
335       3  29.699118   7.8958       0
547       2  29.699118  13.8625       0
651       2  18.000000  23.0000       1
838       3  32.000000  56.4958       0
158       3  29.699118   8.6625       0
63        3   4.000000  27.9000       0

In [22]:
#Checking y_test samples.

y_test[0:10]

251    0
400    1
868    0
699    0
335    0
547    1
651    1
838    1
158    0
63     0
Name: Survived, dtype: int64

In [23]:
#For our first 10 samples of x_test y_predicted i.e, y_test

model.predict(X_test[0:10])

array([1, 0, 0, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [24]:
#Now to predict the probability of our model prediction.

model.predict_proba(X_test[:10])

array([[0.40853163, 0.59146837],
       [0.97640187, 0.02359813],
       [0.97431904, 0.02568096],
       [0.97661008, 0.02338992],
       [0.97413902, 0.02586098],
       [0.94465152, 0.05534848],
       [0.19162074, 0.80837926],
       [0.95182509, 0.04817491],
       [0.97423152, 0.02576848],
       [0.94448996, 0.05551004]])

In [25]:
#Now calculate our score value for 5 values by using cross validation

from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.8       , 0.8       , 0.8       , 0.82258065, 0.77419355])